// 4. Для предыдущего задания создайте функцию, которая будет принимать в себя массив объектов - сотрудников, и каждому из объектов
//        будет добавлять новое свойство "salary", хранящее зарплату сотрудника.
//        Зарплата расчитывается, исходя из значения свойства "occupation" следующим образом:
//            • "director" — 9000;
//            • "manager" — 1500;
//            • "programmer" — 10000;
//            • для остальных значений — 1000.
//        После выполнения функции — вывести информацию о сотрудниках.


